{
    "twitter": [
        "🎶 Turn text into tunes! 🤖🎵  Introducing MidiMaker Generator, an open-source project using LLMs to create MIDI music from your descriptions.  Sectional generation for coherence, compact format for efficiency! #AIMusic #MusicGeneration #MachineLearning",
        "Struggling with musical coherence in AI music? 🤔 MidiMaker Generator breaks down the generation process into sections, using a concise symbolic format to create structured MIDI music from text. Explore the project! [Placeholder link to project] #LLMs #MusicTech #OpenSource",
        "Want to generate your own music with AI? 🎼  MidiMaker Generator is here!  Describe your musical idea, and let the LLMs do the rest.  From text to MIDI, section by section.  Check it out and contribute! [Placeholder link to project] #CreativeAI #MusicAI #Python"
    ],
    "linkedin": [
        "Excited to share MidiMaker Generator, a project exploring the innovative use of Large Language Models for MIDI music generation from textual descriptions. This approach addresses long-form coherence through sectional generation and a compact symbolic representation, enhancing control and musical structure. #AIMusic #LLMs #MusicTechnology #Innovation #OpenSource",
        "MidiMaker Generator introduces a novel pipeline for AI-driven music creation, focusing on structured and coherent output. By breaking down the generation into manageable sections and utilizing a concise symbolic format, this project offers a robust framework for translating textual musical ideas into MIDI files. Ideal for researchers and developers in AI and music tech. #ArtificialIntelligence #MusicGeneration #MachineLearning #R&D",
        "Explore the potential of AI in music composition with MidiMaker Generator. This open-source project tackles the challenge of generating longer, musically coherent pieces by employing sectional generation and a compact symbolic format.  Learn more about the architecture and contribute to the project's development. [Placeholder link to project] #MusicAI #DeepLearning #CreativeTechnology #Collaboration"
    ],
    "reddit": [
        "r/artificialintelligence - [Project] MidiMaker Generator: Generate MIDI music from text descriptions using LLMs! We tackled long-form coherence using sectional generation and a compact symbolic format. Open-source and looking for feedback! [Placeholder link to project] #AIMusic #MusicGeneration #LLMs",
        "r/musicproduction -  New tool alert! 🚨 MidiMaker Generator lets you create MIDI music from text using AI.  It generates music section by section for better coherence and uses a simple symbolic format.  Could this be useful for your workflow? 🤔 Check it out! [Placeholder link to project] #MusicAI #MIDI #AItools #MusicProducers",
        "r/programming - Open-source project: MidiMaker Generator - Python script to convert a compact symbolic music format (generated by LLMs) into MIDI files.  Looking for contributors and testers for `music.py` and the overall pipeline.  Details in comments! [Placeholder link to project] #Python #MusicProgramming #OpenSource #MIDI"
    ],
    "facebook": [
        "🎶 Ever dreamed of turning your words into music? ✨  Introducing MidiMaker Generator! This exciting new project uses the power of AI (Large Language Models) to create MIDI music from simple text descriptions.  It generates music section by section to ensure it sounds coherent and structured.  Perfect for anyone interested in AI and music creation! Learn more and explore the possibilities! [Placeholder link to project] #AIMusic #MusicGeneration #CreativeAI #NewProject",
        "Are you fascinated by the intersection of AI and music? 🎵  MidiMaker Generator is an open-source project that explores a unique approach to generating longer, more musically satisfying pieces with Large Language Models.  We use sectional generation and a compact symbolic format to make AI music creation more accessible and controllable.  Join us in pushing the boundaries of AI music! [Placeholder link to project] #OpenSource #MusicTech #ArtificialIntelligence #Innovation",
        "Introducing MidiMaker Generator - a project that makes AI music generation more structured and user-friendly!  This tool uses Large Language Models to turn your text descriptions into MIDI music, section by section, ensuring musical flow and coherence.  Whether you're a musician, developer, or just curious about AI creativity, this project is for you!  Check it out and let us know what you think!  [Placeholder link to project] #MusicAI #LLMs #MachineLearning #Creativity"
    ]
}
